<br><p style="font-family: Arial; font-size:3.75em;font-style:bold">
Pandas <br> <br> <br>pivot tables</p><br><br>

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

We are going to use Titanic data for this part.

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic=sns.load_dataset('titanic')

In [3]:
# TODO: explore the basic information of titanic dataset

The survival rate of men and women.

In [4]:
# TODO: calculate the mean survival rate of men and women using Groupby function

Two-dimensional Groupby will be made easier with pivot_table.

In [5]:
# TODO: calcaulte the survival rate of different genders in different cabin classes

# (1) Using Groupby Function

The pivot table takes simple column-wise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data

In [6]:
# (2) Using pivot table

To make pivot table with a continuous variable. We bin the variable first.

In [7]:
#Survival rate in different age groups
age=pd.cut(titanic['age'],[0,18,80])

titanic.pivot_table('survived',index = ['sex',age],columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [8]:
#Survival rate in different fare groups
fare=pd.qcut(titanic['fare'],2) # compute the quantiles
titanic.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

Options of pivot_table: 1. Specifying different aggregation function (by default is mean).

In [9]:
# TODO: for different genders in different classes, calculate sum for "survived" and mean for "fare"

2. To compute totals along dimensions

In [10]:
titanic.pivot_table('survived','sex','class',margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

<br><p style="font-family: Arial; font-size:3.75em;font-style:bold">
Pandas string operations </p></br>


One strength oy Python is its relative ease in handling and manipulating string data.

In [11]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                  'Eric Idle', 'Terry Jones', 'Michael Palin'])

monte

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3         Eric Idle
4       Terry Jones
5     Michael Palin
dtype: object

Pandas str method: https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#method-summary

In [12]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [13]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [14]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [15]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

### Methods using regular expressions

In [16]:
# TODO: extract the first name

In [17]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4       [Terry Jones]
5     [Michael Palin]
dtype: object

### Indicator variables

get_dummies() is useful when your data has a column containing some sort of coded indicator.

In [18]:
full_monte = pd.DataFrame({'name': monte,
                           'info': ['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C', 'B|C|D']})
full_monte

             name   info
0  Graham Chapman  B|C|D
1     John Cleese    B|D
2   Terry Gilliam    A|C
3       Eric Idle    B|D
4     Terry Jones    B|C
5   Michael Palin  B|C|D

In [19]:
# TODO: split out theses indicator variables into a DataFrame